In [6]:
import pandas as pd
import numpy as np

In [7]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [8]:
df['salary'] = 0

In [9]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [12]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [13]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [14]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [15]:
df['total'] = df['midterm'] + df['final']

In [16]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [17]:
df['average'] = df['total'] / 2

In [18]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [20]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append("A")
    elif row >= 80:
        grades.append("B")
    else:
        grades.append("F")
df['grades'] = grades

In [21]:
df

    name  midterm  final  total  average grades
0   John       95     85    180     90.0      A
1  Jenny       85     80    165     82.5      B
2   Nate       10     30     40     20.0      F

In [23]:
def pass_or_fail(row):
    if row != 'F':
        return 'pass'
    else:
        return 'fail'

In [24]:
df.grades = df.grades.apply(pass_or_fail)

In [25]:
df

    name  midterm  final  total  average grades
0   John       95     85    180     90.0   pass
1  Jenny       85     80    165     82.5   pass
2   Nate       10     30     40     20.0   fail

In [28]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2000-07-27'
    }, 
    {
        'yyyy-mm-dd' : '2000-08-27'
    },
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [29]:
df

   yyyy-mm-dd
0  2000-06-27
1  2000-07-27
2  2000-08-27

In [30]:
def extract_year(row):
    return row.split('-')[0]

In [31]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [32]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2000-07-27  2000
2  2000-08-27  2000